docs/publicarMatematicasConEmacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="es" xml:lang="es">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Cómo publicar páginas web con fórmulas matemáticas en Emacs</title>
<meta name="author" content="Juan E. Gómez-Morantes" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Cómo publicar páginas web con fórmulas matemáticas en Emacs</h1>

<div id="outline-container-org598ce1f" class="outline-2">
<h2 id="org598ce1f">Introducción</h2>
<div class="outline-text-2" id="text-org598ce1f">
<p>
En notas anteriores ya cubrimos <a href="publicarConEmacs.html">cómo publicar sitios web estáticos con Emacs</a>. Sin embargo, estos sitios eran bastante básicos y consistían únicamente de texto. En esta nota vamos a ver cómo publicar fórmulas y contenido matemático usando el mismo sistema de publicación desarrollado en la nota anterior.
</p>
</div>
</div>

<div id="outline-container-orge65017d" class="outline-2">
<h2 id="orge65017d">Dos métodos para mostrar contenido matemático</h2>
<div class="outline-text-2" id="text-orge65017d">
<p>
El <a href="https://orgmode.org/manual/Math-formatting-in-HTML-export.html">manual de <code>orgmode</code></a> nos habla de dos formas de mostrar contenido matemático: procesar fórmulas en formato TeX y convertirlas a imágenes, o usar <a href="https://www.mathjax.org/">MathJax</a>. Si bien el método de las imágenes es efectivo, tiene problemas con la ubicación de las imágenes y no tiene tantas funcionalidades como MathJax. Siendo así, esta nota se centrará en el uso de MathJax.
</p>
</div>
</div>

<div id="outline-container-org870d837" class="outline-2">
<h2 id="org870d837">Formulas en línea</h2>
<div class="outline-text-2" id="text-org870d837">
<p>
El primer tipo de fórmulas que vamos a ver son fórmulas en línea. Estas son fórmulas que fluyen con el texto como \(x²+y²=0\). Éstas se logran poniendo la fórmula (en sintaxis LaTex) entre los delimitadores <code>\( \)</code> dentro de un párrafo. Podría también usarse los delimitadores <code>$ $</code>, pero el manual de MathJax no lo recomienda ya que el símbolo <code>$</code> puede usarse para otros fines dentro de un texto y esto puede generar errores a la hora de mostrar el contenido.
</p>
</div>
</div>

<div id="outline-container-orgb4da574" class="outline-2">
<h2 id="orgb4da574">Formulas independientes</h2>
<div class="outline-text-2" id="text-orgb4da574">
<p>
Para formulas que queramos tener independientes o numeradas, se deben usar los delimitadores <code>$$ $$</code>. Por ejemplo, la siguiente línea
</p>

<pre class="example" id="orgc0dba6f">
$$x+1\over\sqrt{1-x^2}\label{ref1}$$
</pre>

<p>
Nos genera la siguiente ecuación:
</p>

<p>
\[x+1\over\sqrt{1-x^2}\label{ref1}\]
</p>
</div>

<div id="outline-container-orgb26d792" class="outline-3">
<h3 id="orgb26d792">Numeración</h3>
<div class="outline-text-3" id="text-orgb26d792">
<p>
Es importante anotar que Emacs no numera las ecuaciones por defecto. Para obtener esta numeración tenemos que activarla agregando la siguiente línea al inicio del archivo <code>.org</code> a exportar:
</p>

<pre class="example" id="org104a40c">
#+html_mathjax: autonumber: all
</pre>

<p>
También podemos personalizar la variable <code>org-html-mathjax-options</code> si queremos que esto aplique para todos los archivos que exportemos. Finalmente, también podemos agregarla a nuestro archivo <code>.dir-locals.el</code> si queremos que aplique para todos los archivos de nuestro proyecto, pero sin que se tenga en cuenta para archivos por fuera de éste.
</p>

<p>
Si por algún motivo queremos queremos hacer referencia a la primera ecuación \ref{ref1}, lo podemos hacer usando:
</p>

<pre class="example" id="orgda411af">
\ref{ref1}
</pre>

<p>
Ahora, si por algún motivo queremos incluir una fórmula sin numeración, tenemos que agregar =\nonumber al final de la fórmula: 
</p>

<pre class="example" id="org407fe00">
$$x+1\over\sqrt{1-x^2}\nonumber$$
</pre>

<p>
\[x+1\over\sqrt{1-x^2}\nonumber\]
</p>
</div>
</div>

<div id="outline-container-org4f7bedd" class="outline-3">
<h3 id="org4f7bedd">Ambientes LaTex</h3>
<div class="outline-text-3" id="text-org4f7bedd">
<p>
Una de las mejores funcionalidades de MathJax es que permite la inclusión de ambientes de ecuaciones de LaTex. Por ejemplo, el siguiente código en un archivo <code>.org</code>
</p>

<pre class="example" id="orga261f3c">
\begin{align} 
x&amp; = y_1-y_2+y_3-y_5+y_8-\dots &amp;&amp; \text{por \eqref{ref1}}\\ 
&amp; = y'\circ y^* &amp;&amp; \text{por definición}\\ 
&amp; = y(0) y' &amp;&amp; \text {por Axioma 1.} 
\end{align} 
</pre>

<p>
Produce:
</p>

\begin{align} 
x& = y_1-y_2+y_3-y_5+y_8-\dots && \text{por \eqref{ref1}}\\ 
& = y'\circ y^* && \text{por definición}\\ 
& = y(0) y' && \text {por Axioma 1.} 
\end{align} 
</div>
</div>
</div>

<div id="outline-container-org41c5ec0" class="outline-2">
<h2 id="org41c5ec0">Cierre</h2>
<div class="outline-text-2" id="text-org41c5ec0">
<p>
Como ven, las posibilidades de exportar contenido matemático con MathJax son muchas gracias al soporte que tiene de ambientes matemáticos LaTex. El <a href="http://docs.mathjax.org/en/latest/index.html">manual de MathJax</a> ofrece mucha más información como extensiones y opciones de interacción.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Fecha: 2022:07:11</p>
<p class="author">Autor: Juan E. Gómez-Morantes</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.0.50 (<a href="https://orgmode.org">Org</a> mode 9.5.2)</p>
</div>
</body>
</html>
